app/views/orders/show.html.erb

SELECT "order_items".* FROM "order_items" WHERE ("order_items".order_id = 1)
SELECT COUNT(*) FROM "order_items" WHERE ("order_items".order_id = 1)
---
<p>
	Item Count: <%== @order.order_items.count %>