app/controllers/order_items_controller.rb

  def create
    #@order_item = @order.order_items.new(:quantity =>1, :product_id => params[:product_id])
    @order_item = @order.order_items.find_or_initialize_by_product_id(params[:product_id])
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."product_id" = 1 AND ("order_items".order_id = 13) LIMIT 1

  def index
    @order_item = OrderItem.all
---
SELECT "order_items".* FROM "order_items"

  def show
      @order_item = OrderItem.find(params[:id])
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."id" = 2 LIMIT 1

  def edit
    @order_item = OrderItem.find(params[:id])
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."id" = 2 LIMIT 1

  def update
    @order_item = OrderItem.find(params[:id])
    if @order_item.update_attributes(params[:order_item])
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."id" = 2 LIMIT 1
UPDATE "order_items" SET "quantity" = 1, "updated_at" = '2011-08-25 02:27:24.874859' WHERE "order_items"."id" = 2

  def destroy
    @order_item = OrderItem.find(params[:id])
    @order_item.destroy
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."id" = 1 LIMIT 1
DELETE FROM "order_items" WHERE "order_items"."id" = 1