app/controllers/orders_controller.rb

  def create
    @order = Order.new(params[:order])
    if @order.save
---
INSERT INTO "orders" ("customer_id", "status", "created_at", "updated_at") VALUES (0, 'notshipped', '2011-08-21 03:57:17.093748', '2011-08-21 03:57:17.093748')

  def update
    @order = Order.find(params[:id])
    if @order.update_attributes(params[:order])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 2 LIMIT 1
UPDATE "orders" SET "customer_id" = 2, "updated_at" = '2011-08-25 04:08:30.617416' WHERE "orders"."id" = 2