app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])
    if @product.save
---
INSERT INTO "products" ("title", "price", "description", "image_url", "created_at", "updated_at") VALUES ('Green Grapes (1 bunch)', 200, '1 bunch of approximately 80 green grapes', 'green_grapes.jpg', '2011-08-13 06:28:11.700625', '2011-08-13 06:28:11.700625')

  def update
    @product = Product.find(params[:id])
    if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 5 LIMIT 1
UPDATE "products" SET "price" = 500, "updated_at" = '2011-08-13 11:31:46.021019' WHERE "products"."id" = 5